app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-08-08 20:17:23.865828"], ["updated_at", "2018-08-08 20:17:23.865828"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-08-08 20:17:23.894917"], ["updated_at", "2018-08-08 20:17:23.894917"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |lead|
      song = Song.create(title: lead[0])
      song.create_artist(name: lead[1]) unless Artist.find_by(name: lead[1])